In [5]:
# import dependencies
import os
import pandas as pd
import sys
sys.path.append('./00_config')
from password import username, password
from sqlalchemy import create_engine, inspect
from sqlalchemy_utils import database_exists, create_database

In [8]:
# set csv import path
countrypath=os.path.join('01_transform_data','country.csv')
geogpath=os.path.join('01_transform_data','geog_region.csv')
sdgregionpath=os.path.join('01_transform_data','sdg_region.csv')
subregionpath=os.path.join('01_transform_data','subregion.csv')
undevgrppath=os.path.join('01_transform_data','un_devgrp.csv')
wbincgrppath=os.path.join('01_transform_data','worldbank_incgrp.csv')
poppath=os.path.join('01_transform_data','population.csv')
demopath=os.path.join('01_transform_data','demographic.csv')

In [10]:
# create engine and database
engine = create_engine('postgresql://'+username+':'+password+'@localhost/world_population')
if not database_exists(engine.url):
    create_database(engine.url)

ModuleNotFoundError: No module named 'psycopg2'

In [4]:
# import data
countrydata=pd.read_csv(countrypath)
geogdata=pd.read_csv(geogpath)
sdgregiondata=pd.read_csv(sdgregionpath)
subregiondata=pd.read_csv(subregionpath)
undevgrpdata=pd.read_csv(undevgrppath)
wbincgrpdata=pd.read_csv(wbincgrppath)
popdata=pd.read_csv(poppath)
demodata=pd.read_csv(demopath)

In [5]:
# examine tables
countrydata.head()

,id,iso3_code,country,sdg_region_id,subregion_id,geography_id,un_developmentgroup_id,worldbank_incomegroup_id
0,108,BDI,Burundi,947,910,903,941,1500
1,174,COM,Comoros,947,910,903,941,1500
2,262,DJI,Djibouti,947,910,903,941,1501
3,232,ERI,Eritrea,947,910,903,941,1500
4,231,ETH,Ethiopia,947,910,903,941,1500

In [6]:
geogdata.head()

    id                             name
0  903                           Africa
1  935                             Asia
2  904  Latin America And The Caribbean
3  909                          Oceania
4  908                           Europe

In [7]:
sdgregiondata.head()

     id                              name
0   947                Sub-Saharan Africa
1  1833  Northern Africa And Western Asia
2   921         Central And Southern Asia
3  1832    Eastern And South-Eastern Asia
4  1830   Latin America And The Caribbean

In [8]:
subregiondata.head()

    id             name
0  910   Eastern Africa
1  911    Middle Africa
2  913  Southern Africa
3  914   Western Africa
4  912  Northern Africa

In [9]:
undevgrpdata.head()

    id                                               name
0  941                          Least Developed Countries
1  934  Less Developed Regions, Excluding Least Develo...
2  901                             More Developed Regions

In [10]:
wbincgrpdata.head()

     id                           name
0  1500           Low-Income Countries
1  1501  Lower-Middle-Income Countries
2  1502  Upper-Middle-Income Countries
3  1518      No Income Group Available
4  1503          High-Income Countries

In [11]:
popdata.head()

,country_id,year,age_start,age_end,population_male_thousands,population_female_thousands,population_total_thousands
0,4,1950,0,4,630.044,661.578,1291.622
1,4,1950,5,9,516.206,487.335,1003.541
2,4,1950,10,14,461.378,423.326,884.704
3,4,1950,15,19,414.369,369.363,783.732
4,4,1950,20,24,374.109,318.392,692.501

In [12]:
# create year table
yeardata=pd.DataFrame({"year":popdata["year"].unique().tolist()})
yeardata

    year
0   1950
1   1951
2   1952
3   1953
4   1954
..   ...
65  2015
66  2016
67  2017
68  2018
69  2019

[70 rows x 1 columns]

In [13]:
# create age table
agedata=pd.DataFrame({"age_start":popdata["age_start"].unique().tolist(),"age_end":popdata["age_end"].unique().tolist(),})
agedata

    age_start  age_end
0           0        4
1           5        9
2          10       14
3          15       19
4          20       24
5          25       29
6          30       34
7          35       39
8          40       44
9          45       49
10         50       54
11         55       59
12         60       64
13         65       69
14         70       74
15         75       79
16         80       84
17         85       89
18         90       94
19         95       99
20        100      104

In [14]:
demodata.head()

,country_id,year,death_thousands,death_male_thousands,death_female_thousands,crude_death,life_exp,life_exp_male,life_exp_female,infant_death,infant_mortality,underfive_mortality,birth_thousands,crude_birth,total_fertility,total_pop_natural_change,rate_natural_increase,pop_change,pop_growth_percent
0,108,1950,60.470,30.916,29.554,25.929,38.422,36.856,39.987,20.154,169.825,286.357,118.338,50.695,6.814,57.868,24.766,50.950,2.207
1,108,1951,60.719,31.058,29.662,25.787,38.574,37.008,40.138,20.150,168.932,284.860,118.957,50.494,6.807,58.238,24.706,48.587,2.060
2,108,1952,61.215,31.337,29.878,25.505,38.877,37.311,40.440,20.151,167.148,281.873,120.265,50.113,6.798,59.050,24.608,44.337,1.843
3,108,1953,61.706,31.610,30.096,25.223,39.179,37.612,40.741,20.170,165.369,278.901,121.711,49.774,6.795,60.005,24.551,43.080,1.759
4,108,1954,62.192,31.877,30.316,24.941,39.479,37.911,41.041,20.208,163.594,275.943,123.297,49.477,6.798,61.105,24.537,44.024,1.766

In [15]:
#drop table if exists
engine.execute("DROP TABLE IF EXISTS demographic")
engine.execute("DROP TABLE IF EXISTS population")
engine.execute("DROP TABLE IF EXISTS country")
engine.execute("DROP TABLE IF EXISTS geography")
engine.execute("DROP TABLE IF EXISTS sdg_region")
engine.execute("DROP TABLE IF EXISTS subregion")
engine.execute("DROP TABLE IF EXISTS un_developmentgroup")
engine.execute("DROP TABLE IF EXISTS worldbank_incomegroup")
engine.execute("DROP TABLE IF EXISTS year")
engine.execute("DROP TABLE IF EXISTS age")

In [16]:
# create tables & constraints in SQL
# age table
engine.execute("CREATE TABLE age (\
                    age_start INT NOT NULL,\
                    age_end INT NOT NULL,\
                    PRIMARY KEY (age_start,age_end))")
# year table
engine.execute("CREATE TABLE year (year INT NOT NULL PRIMARY KEY)")
# world bank income group table
engine.execute("CREATE TABLE worldbank_incomegroup (\
                    id INT NOT NULL PRIMARY KEY,\
                    name VARCHAR(100) NOT NULL)")
# UN development group table
engine.execute("CREATE TABLE un_developmentgroup (\
                    id INT NOT NULL PRIMARY KEY,\
                    name VARCHAR(100) NOT NULL)")
# subregion table
engine.execute("CREATE TABLE subregion (\
                    id INT NOT NULL PRIMARY KEY,\
                    name VARCHAR(100) NOT NULL)")
# SDG region table
engine.execute("CREATE TABLE sdg_region (\
                    id INT NOT NULL PRIMARY KEY,\
                    name VARCHAR(100) NOT NULL)")
# geographical region table
engine.execute("CREATE TABLE geography (\
                    id INT NOT NULL PRIMARY KEY,\
                    name VARCHAR(100) NOT NULL)")
# country table
engine.execute("CREATE TABLE country (\
                    id INT NOT NULL PRIMARY KEY,\
                    iso3_code CHAR(3) UNIQUE NOT NULL,\
                    country VARCHAR(100) UNIQUE NOT NULL,\
                    sdg_region_id INT NOT NULL,\
                    subregion_id INT NOT NULL,\
                    geography_id INT NOT NULL,\
                    un_developmentgroup_id INT NOT NULL,\
                    worldbank_incomegroup_id INT NOT NULL,\
                    FOREIGN KEY (sdg_region_id)\
                    REFERENCES sdg_region(id),\
                    FOREIGN KEY (subregion_id)\
                    REFERENCES subregion(id),\
                    FOREIGN KEY (geography_id)\
                    REFERENCES geography(id),\
                    FOREIGN KEY (un_developmentgroup_id)\
                    REFERENCES un_developmentgroup(id),\
                    FOREIGN KEY (worldbank_incomegroup_id)\
                    REFERENCES worldbank_incomegroup(id))")
# population table
engine.execute("CREATE TABLE population (\
                    id SERIAL PRIMARY KEY,\
                    country_id INT NOT NULL,\
                    year INT NOT NULL,\
                    age_start INT NOT NULL,\
                    age_end INT NOT NULL,\
                    population_male_thousands DECIMAL NOT NULL,\
                    population_female_thousands DECIMAL NOT NULL,\
                    population_total_thousands DECIMAL NOT NULL,\
                    FOREIGN KEY (country_id)\
                    REFERENCES country(id),\
                    FOREIGN KEY (year)\
                    REFERENCES year(year),\
                    FOREIGN KEY (age_start,age_end)\
                    REFERENCES age(age_start,age_end))")
# demographic table
engine.execute("CREATE TABLE demographic (\
                    id SERIAL PRIMARY KEY,\
                    country_id INT NOT NULL,\
                    year INT NOT NULL,\
                    death_thousands DECIMAL NOT NULL,\
                    death_male_thousands DECIMAL NOT NULL,\
                    death_female_thousands DECIMAL NOT NULL,\
                    crude_death DECIMAL NOT NULL,\
                    life_exp DECIMAL NOT NULL,\
                    life_exp_male DECIMAL NOT NULL,\
                    life_exp_female DECIMAL NOT NULL,\
                    infant_death DECIMAL NOT NULL,\
                    infant_mortality DECIMAL NOT NULL,\
                    underfive_mortality DECIMAL NOT NULL,\
                    birth_thousands DECIMAL NOT NULL,\
                    crude_birth DECIMAL NOT NULL,\
                    total_fertility DECIMAL NOT NULL,\
                    total_pop_natural_change DECIMAL NOT NULL,\
                    rate_natural_increase DECIMAL NOT NULL,\
                    pop_change DECIMAL NOT NULL,\
                    pop_growth_percent DECIMAL NOT NULL,\
                    FOREIGN KEY (country_id)\
                    REFERENCES country(id),\
                    FOREIGN KEY (year)\
                    REFERENCES year(year))")

In [17]:
# save data into SQL database
yeardata.to_sql(name='year', con=engine, if_exists='append', index=False)
agedata.to_sql(name='age', con=engine, if_exists='append', index=False)
wbincgrpdata.to_sql(name='worldbank_incomegroup', con=engine, if_exists='append', index=False)
undevgrpdata.to_sql(name='un_developmentgroup', con=engine, if_exists='append', index=False)
subregiondata.to_sql(name='subregion', con=engine, if_exists='append', index=False)
sdgregiondata.to_sql(name='sdg_region', con=engine, if_exists='append', index=False)
geogdata.to_sql(name='geography', con=engine, if_exists='append', index=False)
countrydata.to_sql(name='country', con=engine, if_exists='append', index=False)
popdata.to_sql(name='population', con=engine, if_exists='append', index=False)
demodata.to_sql(name='demographic',con=engine, if_exists='append', index=False)

In [18]:
# ensure that tables are in database
inspector = inspect(engine)
tables=inspector.get_table_names()
print(tables)

['sdg_region', 'country', 'subregion', 'geography', 'un_developmentgroup', 'worldbank_incomegroup', 'demographic', 'population', 'year', 'age']

In [19]:
# confirm each table exists in sql by querying it
for table in tables:
    query='select * from '+ table
    print(pd.read_sql_query(query, con=engine).head())

     id                              name
0   947                Sub-Saharan Africa
1  1833  Northern Africa And Western Asia
2   921         Central And Southern Asia
3  1832    Eastern And South-Eastern Asia
4  1830   Latin America And The Caribbean
    id iso3_code   country  sdg_region_id  subregion_id  geography_id  \
0  108       BDI   Burundi            947           910           903
1  174       COM   Comoros            947           910           903
2  262       DJI  Djibouti            947           910           903
3  232       ERI   Eritrea            947           910           903
4  231       ETH  Ethiopia            947           910           903

   un_developmentgroup_id  worldbank_incomegroup_id
0                     941                      1500
1                     941                      1500
2                     941                      1501
3                     941                      1500
4                     941                      1500
    id             name
0  910   Eastern Africa
1  911    Middle Africa
2  913  Southern Africa
3  914   Western Africa
4  912  Northern Africa
    id                             name
0  903                           Africa
1  935                             Asia
2  904  Latin America And The Caribbean
3  909                          Oceania
4  908                           Europe
    id                                               name
0  941                          Least Developed Countries
1  934  Less Developed Regions, Excluding Least Develo...
2  901                             More Developed Regions
     id                           name
0  1500           Low-Income Countries
1  1501  Lower-Middle-Income Countries
2  1502  Upper-Middle-Income Countries
3  1518      No Income Group Available
4  1503          High-Income Countries
   id  country_id  year  death_thousands  death_male_thousands  \
0   1         108  1950           60.470                30.916
1   2         108  1951           60.719                31.058
2   3         108  1952           61.215                31.337
3   4         108  1953           61.706                31.610
4   5         108  1954           62.192                31.877

   death_female_thousands  crude_death  life_exp  life_exp_male  \
0                  29.554       25.929    38.422         36.856
1                  29.662       25.787    38.574         37.008
2                  29.878       25.505    38.877         37.311
3                  30.096       25.223    39.179         37.612
4                  30.316       24.941    39.479         37.911

   life_exp_female  infant_death  infant_mortality  underfive_mortality  \
0           39.987        20.154           169.825              286.357
1           40.138        20.150           168.932              284.860
2           40.440        20.151           167.148              281.873
3           40.741        20.170           165.369              278.901
4           41.041        20.208           163.594              275.943

   birth_thousands  crude_birth  total_fertility  total_pop_natural_change  \
0          118.338       50.695            6.814                    57.868
1          118.957       50.494            6.807                    58.238
2          120.265       50.113            6.798                    59.050
3          121.711       49.774            6.795                    60.005
4          123.297       49.477            6.798                    61.105

   rate_natural_increase  pop_change  pop_growth_percent
0                 24.766      50.950               2.207
1                 24.706      48.587               2.060
2                 24.608      44.337               1.843
3                 24.551      43.080               1.759
4                 24.537      44.024               1.766
   id  country_id  year  age_start  age_end  population_male_thousands  \
0   1           4  1950          0        4                    630.044
1   2           4  1950          5        9                    516.206
2   3           4  1950         10       14                    461.378
3   4           4  1950         15       19                    414.369
4   5           4  1950         20       24                    374.109

   population_female_thousands  population_total_thousands
0                      661.578                    1291.622
1                      487.335                    1003.541
2                      423.326                     884.704
3                      369.363                     783.732
4                      318.392                     692.501
   year
0  1950
1  1951
2  1952
3  1953
4  1954
   age_start  age_end
0          0        4
1          5        9
2         10       14
3         15       19
4         20       24